archive/before-2018-11-10/2017-07-03-grep工具.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-07-03-grep工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-07-03-grep工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgef6b6fa">1. grep</a></li>
<li><a href="#ag">2. ag(the_silver_searcher)</a></li>
<li><a href="#org938bbe4">3. rg(ripgrep)</a></li>
<li><a href="#org0924ebc">4. ack</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgef6b6fa" class="outline-2">
<h2 id="orgef6b6fa"><span class="section-number-2">1</span> grep</h2>
<div class="outline-text-2" id="text-1">
<p>
刚开始使用linux的时候就了解了grep了。基本天天都要用。和很多linux下的
工具一样，做得事情很简单，但实用。
</p>

<p>
总结一些常用的选项功能：
</p>
<ol class="org-ol">
<li><code>-i</code> ：忽略大小写。</li>
<li><code>-R</code> ：递归地搜索目录。</li>
<li><code>-e</code> ：如果需要搜索多个 <code>pattern</code> ，可以使用多个 <code>-e</code> 选项。这样
每个 <code>pattern</code> 满足都会找出来。另外，它还适合以 <code>-</code> 开头的
<code>pattern</code> 。</li>
<li><code>-A</code> ：显示满足条件行的下面几行。比如 <code>grep -A20</code> 显示下面20行。</li>
<li><code>-B</code> ：显示满足条件行的上面几行。比如 <code>grep -B20</code> 显示上面20行。</li>
<li><code>-C</code> ：显示满足条件行的上面和下面几行。比如 <code>grep -C20</code> 显示上面
20行和下面20行。</li>
<li><code>-n</code> ：显示引号。</li>
<li><code>-l</code> ：加上该选项，结果只会显示包含的 <code>pattern</code> 的文件名，不会再
显示对应行的内容。</li>
</ol>
</div>
</div>

<div id="outline-container-orgcbfda4d" class="outline-2">
<h2 id="ag"><a id="orgcbfda4d"></a><span class="section-number-2">2</span> <a href="https://github.com/ggreer/the_silver_searcher">ag(the_silver_searcher)</a></h2>
<div class="outline-text-2" id="text-ag">
<p>
遇然情况下知道了ag，试用一下，感觉比grep快好多啊。于是Emacs中也换成
ag。
</p>

<ol class="org-ol">
<li>它可以根据 <code>.gitignore</code> 等文件过滤掉一些无关的文件。</li>
<li>使用 <code>Pthread</code> 来并行搜索，发挥CPU的全部实力。</li>
<li>一个字母一个字母搜索的时候，使用 <a href="https://en.wikipedia.org/wiki/Boyer%E2%80%93Moore_string_search_algorithm">BM算法</a> 来加速。</li>
<li>使用 <a href="http://sljit.sourceforge.net/pcre.html">PCRE's JIT</a> 来操作正则。</li>
<li>在把每个相同的正则应用到每个文件时，ag会先调用 <code>pcre_study()</code> 函
数。</li>
<li>不会对ignore的文件调用 <code>fnmatch()</code> 函数，非正则的 <code>pattern</code> 会直
接载入到数组中进行二进制搜索。</li>
</ol>

<p>
ag的正则支持multiline搜索。
</p>

<p>
ag可以忽略一些目录，开始时使用 <code>.agignore</code> 文件。 <code>2.0.0</code> 以后，该名
字改为 <code>.ignore</code> 。写法和 <code>.gitignore</code> 是一样的。
</p>
</div>
</div>

<div id="outline-container-org938bbe4" class="outline-2">
<h2 id="org938bbe4"><span class="section-number-2">3</span> <a href="https://github.com/BurntSushi/ripgrep">rg(ripgrep)</a></h2>
<div class="outline-text-2" id="text-3">
<p>
这是我最后了解到的工具。
</p>

<p>
快的原因：
</p>
<pre class="example">
    It is built on top of Rust's regex engine. Rust's regex engine uses
    finite automata, SIMD and aggressive literal optimizations to make
    searching very fast.

    Rust's regex library maintains performance with full Unicode support
    by building UTF-8 decoding directly into its deterministic finite
    automaton engine.

    It supports searching with either memory maps or by searching
    incrementally with an intermediate buffer. The former is better for
    single files and the latter is better for large directories. ripgrep
    chooses the best searching strategy for you automatically.

    Applies your ignore patterns in .gitignore files using a
    RegexSet. That means a single file path can be matched against
    multiple glob patterns simultaneously.

    It uses a lock-free parallel recursive directory iterator, courtesy of
    crossbeam and ignore.
</pre>

<p>
实际使用时，我需要rg忽略某些目录。可以使用 <code>.rgignore</code> 文件来指定。
比如在一个git库的根目录下新建一个 <code>.rgignore</code> 。按照 <code>.gitignore</code> 随
便写点就可以了。
</p>
</div>
</div>

<div id="outline-container-org0924ebc" class="outline-2">
<h2 id="org0924ebc"><span class="section-number-2">4</span> ack</h2>
<div class="outline-text-2" id="text-4">
<p>
这个工具只是知道，没有用过。据说如果没有ack就没有 <a href="#ag">ag</a> 。它是用纯perl
来做的。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>